<a href="https://colab.research.google.com/github/EvgeniiSopov/PrIS_05/blob/main/PrIS_09_03_2021.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Мини проект для работы с гит и гитхаб.

<h2> Exploratory data analysis (EDA) </h2>

<h2> Разветочный (исследовательский) анализ данных </h2>

<img src="http://sharpsightlabs.com/wp-content/uploads/2016/05/1_data-analysis-for-ML_how-we-use-dataAnalysis_2016-05-16.png">

# Import Packages

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

# import data

The study of classification of types of glass was motivated by criminological investigation. At the scene of the crime, the glass left can be used as evidence ... if it is correctly identified!

Attributes are:
1. Id number: 1 to 214
2. RI: refractive index
3. Na: Sodium 
4. Mg: Magnesium
5. Al: Aluminum
6. Si: Silicon
7. K: Potassium
8. Ca: Calcium
9. Ba: Barium
10. Fe: Iron
11. Type of glass

Type of glass:
1. building_windows_float_processed
2. building_windows_non_float_processed
3. vehicle_windows_float_processed
4. vehicle_windows_non_float_processed (none in this database)
5. containers
6. tableware
7. headlamps

In [3]:
data = pd.read_csv("http://archive.ics.uci.edu/ml/machine-learnin
g-databases/glass/glass.data", header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [4]:
names = ["Id","RI", "Na", "Mg", "Al", 
         "Si", "K", "Ca", "Ba", 
         "Fe", "Class"]
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [5]:
data['Class'].replace({1:"building_float", 
                       2:"building_non_float", 
                       3:"vehicle_float",
                       4:"vehicle_non_float", 
                       5:"containers", 
                       6:"tableware",
                       7:"headlamps"}, inplace=True)
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe           Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0  building_float
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0  building_float

In [7]:
for col in data.columns:
    fr = np.random.randint(5,10)/100
    data.loc[data.sample(frac=fr).index, col] = np.nan

In [9]:
data.head(7)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe           Class
0  1.52101  13.64  4.49  1.10    NaN  0.06  8.75  0.0  0.0  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0  building_float
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0  building_float
3  1.51766  13.21  3.69  1.29    NaN  0.57  8.22  0.0  0.0  building_float
4  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.0  building_float
5  1.51596  12.79  3.61  1.62  72.97  0.64  8.07  NaN  NaN  building_float
6  1.51743  13.30  3.60  1.14    NaN  0.58  8.17  0.0  0.0  building_float

# Data Vizualization

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      201 non-null    float64
 1   Na      201 non-null    float64
 2   Mg      199 non-null    float64
 3   Al      195 non-null    float64
 4   Si      199 non-null    float64
 5   K       195 non-null    float64
 6   Ca      195 non-null    float64
 7   Ba      199 non-null    float64
 8   Fe      201 non-null    float64
 9   Class   199 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [11]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  201.000000  201.000000  199.000000  ...  195.000000  199.000000  201.000000
mean     1.518432   13.426070    2.679146  ...    8.983538    0.171206    0.055274
std      0.003077    0.807944    1.440077  ...    1.451423    0.496949    0.096354
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516600   12.930000    2.140000  ...    8.255000    0.000000    0.000000
50%      1.517690   13.330000    3.480000  ...    8.600000    0.000000    0.000000
75%      1.519180   13.870000    3.595000  ...    9.165000    0.000000    0.090000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [16]:
display( data['Class'].describe() )
print("===========================")
display( data['Class'].value_counts() )

count                    199
unique                     6
top       building_non_float
freq                      71
Name: Class, dtype: object

===========================

building_non_float    71
building_float        65
headlamps             27
vehicle_float         16
containers            13
tableware              7
Name: Class, dtype: int64